
main_text = """
Привет! 👋

Многие писали мне в личных сообщениях и задавали вопросы, и я решил сделать бесплатный мини-курс для вас.🙌

Эту информацию можно найти бесплатно на YouTube, поэтому я не стал ставить ценник на эти видео. Я просто структурно собрал все в одном месте и записал эти материалы)😉

В этом боте вы получите 5 обучающих видео и глоссарий к каждому, но главное и единственое условие - это просто быть подписанным и все. Ничего сложного

Советую вам пройти его, не откладывая на потом и перейти к торговле. Вы сами видите на канале, какие результаты мы делаем. Если нет, то ниже ссылка на канал.

Всем удачи, приятного просмотра!🎯

И еще раз - ничего сложного нет, у вас все получится)

P.S. Не фин. совет! Делайте собственный ресерч. Все видео предоставлены в обучающих целях. 
NFA / DYOR
"""


lecture_1 = """
 https://youtu.be/VmHNKukTABE
🎯 Первый урок: Как Сделать Свою Первую $1000?

Привет еще раз, ловите первое видео. Это больше краткое вступление, здесь вы поймете в каком направлении мы будем идти и какие знания вы получите из этих серий бесплатных уроков. 

Ниже прикрепляю глоссарий для тех, кто не знаком с озвученными терминами. Приятного просмотра!

📋 Глоссарий к уроку:

Вот определения для этих терминов:

🟢 Токен — это криптографический актив, который представляет собой некую ценность или право внутри определённой экосистемы, сети или проекта. 

🟢 Децентрализованные биржи (DEX) — это платформы для обмена криптовалют, которые работают без центрального органа или посредников. 

🟢 Централизованные биржи (CEX) — это криптовалютные платформы, которые управляются одной компанией или организацией, которая обеспечивает централизованный контроль за процессом торговли. Примеры: Binance, Kraken, Coinbase.

🟢 Верификация — это процесс проверки личности пользователя с целью предотвращения мошенничества и соблюдения нормативных требований, таких как правила против отмывания денег (AML) и соблюдения политики "Знай своего клиента" (KYC).
"""


lecture_2 = """
https://youtu.be/i9XHZNV-g6c
🎯 Второй урок: Система из 5 супер-простых действий, чтобы выйти на первые $1000.

Вы молодцы! Второе видео посвящено системе поиска проектов в целом - здесь вы узнаете как мы ищем и находим перспективные монеты. Смотрите видео и делайте для себя конспекты. Вы уже близки к своим первым заработкам!

📋 Глоссарий к уроку: 

Конечно, вот разъяснения для этих терминов:

🟢 Нарративы — ключевые истории или идеи, которые формируют общественное восприятие и тренды. Нарративы могут включать в себя представление о потенциальной ценности криптовалюты, идеях её использования или философии, стоящей за проектом. 

🟢 DexScreener — это инструмент для анализа данных, ориентированный на децентрализованные биржи (DEX). Он предоставляет информацию о текущих ценах, объемах торгов, графиках и других метках криптовалют, торгующихся на децентрализованных платформах, таких как Uniswap, PancakeSwap и другие. 

🟢 Токеномика — это концепция экономики токенов внутри конкретного проекта или блокчейн-экосистемы. Токеномика охватывает такие аспекты, как распределение токенов (кто и сколько получает), роль токенов в экосистеме (например, для голосования, вознаграждений или доступа), механизмы инфляции и дефляции, и т. д. 

🟢 Памп — это резкое повышение цены актива, которое часто связано с массовым интересом и спекуляциями. Памп может быть результатом манипуляций, например, скоординированных действий группы людей, которые покупают токен, что вызывает ажиотаж и дальнейший рост цены.

🟢 Тикер — это сокращённое название или символ криптовалюты (например, BTC для биткойна или ETH для эфира). 

🟢 Стоп-лосс — это ордер, который автоматически продаёт актив, если его цена падает до заданного уровня. Это механизм защиты от потерь: трейдер устанавливает стоп-лосс, чтобы ограничить убытки в случае, если рынок двигается против его позиции.

🟢 Тейк-профит — это ордер, который автоматически продаёт актив, если его цена достигает заранее установленного уровня прибыли. Этот ордер помогает зафиксировать прибыль, не требуя постоянного мониторинга рынка.

"""


lecture_3 = """
 https://youtu.be/ZG5uLdeBjmY
 🎯 Третий урок: Как использовать бесплатный канал сигналов?

Вы уже прошли пол пути! В этом видео вы узнаете как использовать самое ценное звено нашей системы - мой канал сигналов. Посмотрите видео и у вас сразу исчезнут очень много вопросов касательно канала. Приятного просмотра!

📋 Глоссарий к уроку:

Вот определения для этих терминов:

🟢 Адрес контракта токена — это уникальный идентификатор, который представляет смарт-контракт токена в блокчейне. Каждый токен, будь то ERC-20 (на базе Ethereum) или BEP-20 (на Binance Smart Chain), имеет свой уникальный адрес контракта. 

🟢 Скам — это термин, который обозначает мошенничество в криптовалютной сфере. Проекты, которые являются скамом, могут обманывать инвесторов с целью заработать на их вложениях, при этом не предоставляя реальной ценности. 

🟢 Маркет-кап (Market Cap) — это рыночная капитализация криптовалюты, которая рассчитывается как произведение текущей цены токена на общее количество токенов в обращении. 

🟢 DYOR (Do Your Own Research) — это призыв к тому, чтобы каждый инвестор самостоятельно проводил исследование перед тем, как вкладывать деньги в какой-либо проект. 

🟢 ATH (All-Time High) — это максимальная цена, которую криптовалюта или актив когда-либо достигал за всё время существования. Например, если цена биткойна когда-то достигала $69,000, то это его ATH.

"""

lecture_4 = """
 https://youtu.be/2aLuO4uE7PY
🎯 Четвертый урок: BullX - бот и сайт с низкими комиссиями и удобным функционалом

Это предпоследнее и самое интересное видео нашей серии. Вы почти у цели! Научитесь пользоваться ботом BullX и сайтом для торговли. В этом нет ничего сложного, посмотрите это видео!

📋 Глоссарий к уроку:

Вот объяснения для этих терминов:

🟢 Ликвидность — это способность актива или рынка легко конвертироваться в деньги или другие активы без значительных колебаний цены. На высоколиквидном рынке активы можно быстро купить или продать по близким к рыночным ценам. 

🟢 P2P (Peer-to-Peer) — это система, при которой пользователи могут напрямую обмениваться криптовалютами или другими активами друг с другом без участия посредников (например, бирж). 

🟢 Solana — это блокчейн-платформа, предназначенная для высокоскоростных и дешевых транзакций. Solana поддерживает смарт-контракты, и её токен называется SOL.

🟢 Маркет-ордер — это ордер на покупку или продажу актива по текущей рыночной цене. Это означает, что ордер будет выполнен немедленно, но цена может немного варьироваться в зависимости от ликвидности на рынке. 

🟢 Лимит-ордер — это ордер на покупку или продажу актива по заранее установленной цене или лучше. Например, если вы хотите купить токен по цене $50, вы ставите лимит-ордер на $50.

"""



lecture_5 = """
 https://youtu.be/Khbat61v69M
 🎯 Пятый урок: Как не потерять заработанные деньги. Риск-менеджмент.

Соблюдайте риск-менеджмент. Это крайне важно, чтобы не потерять заработанные деньги. Многие люди теряют свои деньги из-за базовых ошибок. Здесь я назвал эти самые ошибки - не повторяйте их. 

📋 Глоссарий к уроку:

🟢  Журнал сделок — это запись всех операций, совершённых трейдером или инвестором. В журнале фиксируются данные о покупке и продаже активов, такие как дата и время, цена, количество, комиссии и другие важные параметры.

🟢  Точки входа — это моменты, когда трейдер или инвестор решает войти в рынок, то есть купить актив. Точка входа обычно определяется с помощью анализа графиков, технических индикаторов, новостей или других факторов, которые могут сигнализировать о выгодном моменте для покупки.

🟢  Dip — это термин, который обозначает временное снижение цены актива, особенно если это падение кажется краткосрочным.


"""


end_1 ="""
Итак, вы завершили уроки! Можете похвалить себя)

Я буду здесь выкладывать также гайды на других ботов и другие интересные обучающие материалы. Оставайтесь, чтобы не упускать их!

Переходите по ссылкам, смотрите мои видео на канале, а также начните торговать - по малому, но постепенно и у вас все получится!
"""

end_2 = """
⚠️ Не забудьте оставить отзыв о курсе, плиз в личных сообщениях. Это очень поможет мне понять насколько вам помог курс и как можно дальше работать над развитием!
"""